In [50]:
import numpy as np
import pandas as pd

In [51]:
dict1={
    "name":['harry','rohan','subh','sid'],
    "marks":[90,34,24,98],
    "city":['rampur','parasi','bishnupura','butwal']
}

In [52]:
df=pd.DataFrame(dict1) # makes dataframes

In [53]:
df

    name  marks        city
0  harry     90      rampur
1  rohan     34      parasi
2   subh     24  bishnupura
3    sid     98      butwal

In [54]:
df.to_csv('friend.csv')

In [55]:
df.to_csv('friend_index_false.csv',index=False)

In [56]:
df.head(2) # it will show first two rows

    name  marks    city
0  harry     90  rampur
1  rohan     34  parasi

In [57]:
df.tail(2)  # it will show  last two rows

   name  marks        city
2  subh     24  bishnupura
3   sid     98      butwal

In [58]:
df.describe()  #it will show all the statistics operation

           marks
count   4.000000
mean   61.500000
std    37.890192
min    24.000000
25%    31.500000
50%    62.000000
75%    92.000000
max    98.000000

In [59]:

data=pd.read_csv('matches.csv')

In [60]:
data

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2017,Hyderabad,2017-04-05,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN
1,2,2017,Pune,2017-04-06,Mumbai Indians,Rising Pune Supergiant,Rising Pune Supergiant,field,normal,0,Rising Pune Supergiant,0,7,SPD Smith,Maharashtra Cricket Association Stadium,A Nand Kishore,S Ravi,NaN
2,3,2017,Rajkot,2017-04-07,Gujarat Lions,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,10,CA Lynn,Saurashtra Cricket Association Stadium,Nitin Menon,CK Nandan,NaN
3,4,2017,Indore,2017-04-08,Rising Pune Supergiant,Kings XI Punjab,Kings XI Punjab,field,normal,0,Kings XI Punjab,0,6,GJ Maxwell,Holkar Cricket Stadium,AK Chaudhary,C Shamshuddin,NaN
4,5,2017,Bangalore,2017-04-08,Royal Challengers Bangalore,Delhi Daredevils,Royal Challengers Bangalore,bat,normal,0,Royal Challengers Bangalore,15,0,KM Jadhav,M Chinnaswamy Stadium,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
631,632,2016,Raipur,2016-05-22,Delhi Daredevils,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Royal Challengers Bangalore,0,6,V Kohli,Shaheed Veer Narayan Singh International Stadium,A Nand Kishore,BNJ Oxenford,NaN
632,633,2016,Bangalore,2016-05-24,Gujarat Lions,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Royal Challengers Bangalore,0,4,AB de Villiers,M Chinnaswamy Stadium,AK Chaudhary,HDPK Dharmasena,NaN
633,634,2016,Delhi,2016-05-25,Sunrisers Hyderabad,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Sunrisers Hyderabad,22,0,MC Henriques,Feroz Shah Kotla,M Erasmus,C Shamshuddin,NaN
634,635,2016,Delhi,2016-05-27,Gujarat Lions,Sunrisers Hyderabad,Sunrisers Hyderabad,field,normal,0,Sunrisers Hyderabad,0,4,DA Warner,Feroz Shah Kotla,M Erasmus,CK Nandan,NaN
635,636,2016,Bangalore,2016-05-29,Sunrisers Hyderabad,Royal Challengers Bangalore,Sunrisers Hyderabad,bat,normal,0,Sunrisers Hyderabad,8,0,BCJ Cutting,M Chinnaswamy Stadium,HDPK Dharmasena,BNJ Oxenford,NaN

In [61]:
data.head(5)

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2017,Hyderabad,2017-04-05,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN
1,2,2017,Pune,2017-04-06,Mumbai Indians,Rising Pune Supergiant,Rising Pune Supergiant,field,normal,0,Rising Pune Supergiant,0,7,SPD Smith,Maharashtra Cricket Association Stadium,A Nand Kishore,S Ravi,NaN
2,3,2017,Rajkot,2017-04-07,Gujarat Lions,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,10,CA Lynn,Saurashtra Cricket Association Stadium,Nitin Menon,CK Nandan,NaN
3,4,2017,Indore,2017-04-08,Rising Pune Supergiant,Kings XI Punjab,Kings XI Punjab,field,normal,0,Kings XI Punjab,0,6,GJ Maxwell,Holkar Cricket Stadium,AK Chaudhary,C Shamshuddin,NaN
4,5,2017,Bangalore,2017-04-08,Royal Challengers Bangalore,Delhi Daredevils,Royal Challengers Bangalore,bat,normal,0,Royal Challengers Bangalore,15,0,KM Jadhav,M Chinnaswamy Stadium,NaN,NaN,NaN

In [62]:
data.tail(4)

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
632,633,2016,Bangalore,2016-05-24,Gujarat Lions,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Royal Challengers Bangalore,0,4,AB de Villiers,M Chinnaswamy Stadium,AK Chaudhary,HDPK Dharmasena,NaN
633,634,2016,Delhi,2016-05-25,Sunrisers Hyderabad,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Sunrisers Hyderabad,22,0,MC Henriques,Feroz Shah Kotla,M Erasmus,C Shamshuddin,NaN
634,635,2016,Delhi,2016-05-27,Gujarat Lions,Sunrisers Hyderabad,Sunrisers Hyderabad,field,normal,0,Sunrisers Hyderabad,0,4,DA Warner,Feroz Shah Kotla,M Erasmus,CK Nandan,NaN
635,636,2016,Bangalore,2016-05-29,Sunrisers Hyderabad,Royal Challengers Bangalore,Sunrisers Hyderabad,bat,normal,0,Sunrisers Hyderabad,8,0,BCJ Cutting,M Chinnaswamy Stadium,HDPK Dharmasena,BNJ Oxenford,NaN

In [63]:
data['city']

0      Hyderabad
1           Pune
2         Rajkot
3         Indore
4      Bangalore
         ...
631       Raipur
632    Bangalore
633        Delhi
634        Delhi
635    Bangalore
Name: city, Length: 636, dtype: object

In [64]:
import pandas as pd 
dict={
    "name":['Sid','Rajiv','Rohit','Pradeep'],
    "city":['parasi','kotihawa','butwal','sunwal'],
    "marks":[94,92,85,89]
}

In [65]:
dt=pd.DataFrame(dict)
dt

      name      city  marks
0      Sid    parasi     94
1    Rajiv  kotihawa     92
2    Rohit    butwal     85
3  Pradeep    sunwal     89

In [66]:
dt.head(2)

    name      city  marks
0    Sid    parasi     94
1  Rajiv  kotihawa     92

In [67]:
dt.tail(2)

      name    city  marks
2    Rohit  butwal     85
3  Pradeep  sunwal     89

In [68]:
dt.describe()

          marks
count   4.00000
mean   90.00000
std     3.91578
min    85.00000
25%    88.00000
50%    90.50000
75%    92.50000
max    94.00000

In [69]:
dt.to_csv('AILearner.csv',index=False)

In [70]:
dt['city']

0      parasi
1    kotihawa
2      butwal
3      sunwal
Name: city, dtype: object

In [71]:
dt['marks'][1]=100

/tmp/ipykernel_4625/3093389794.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  dt['marks'][1]=100
/tmp/ipykernel_4625/3093389794.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dt['marks'][1]=100

In [72]:
dt

      name      city  marks
0      Sid    parasi     94
1    Rajiv  kotihawa    100
2    Rohit    butwal     85
3  Pradeep    sunwal     89

In [183]:
ser=pd.Series(np.random.rand(5))
ser

0    0.415526
1    0.294349
2    0.922650
3    0.739924
4    0.754853
dtype: float64

In [74]:
type(ser)  #it's a series

pandas.core.series.Series

In [75]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [76]:
newdf.head(5)

          0         1         2         3         4
0  0.855727  0.814467  0.157192  0.685140  0.582950
1  0.658487  0.348628  0.581170  0.252771  0.680120
2  0.091923  0.556934  0.990653  0.664003  0.406472
3  0.104064  0.239439  0.642198  0.712952  0.090039
4  0.760758  0.395422  0.985345  0.955724  0.838605

In [77]:
type(newdf)  #it's a dataframe

pandas.core.frame.DataFrame

In [78]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.492558    0.498614    0.498197    0.484368    0.530339
std      0.281656    0.293913    0.291544    0.291725    0.285354
min      0.001720    0.003051    0.000127    0.000629    0.005559
25%      0.265684    0.239085    0.237831    0.245964    0.295733
50%      0.481827    0.498579    0.485082    0.463381    0.537805
75%      0.722249    0.746929    0.748425    0.754955    0.769108
max      0.997803    0.998329    0.996603    0.995664    0.998086

In [79]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [80]:
newdf[0][0]="sid"

/tmp/ipykernel_4625/3828083272.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0]="sid"
/tmp/ipykernel_4625/3828083272.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'sid' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]="sid"

In [81]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [82]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [83]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [84]:
# converting into numpy array
newdf.to_numpy()

array([['sid', 0.8144668969596591, 0.15719196430015014,
        0.6851399499443035, 0.5829496326045431],
       [0.6584871965356388, 0.3486282397970476, 0.5811696643107293,
        0.25277147230744124, 0.6801203028071858],
       [0.09192297957627382, 0.5569335206076436, 0.9906532959007778,
        0.6640025136937381, 0.4064723040295126],
       ...,
       [0.3807694645066557, 0.9983288160647787, 0.9303522856625953,
        0.939310887956847, 0.9927380236857815],
       [0.9126703670931079, 0.7076886342794799, 0.9229484299420021,
        0.23469988642195594, 0.1645082122839301],
       [0.9768275637345651, 0.0075915520592212404, 0.4140772649272556,
        0.8132102349061395, 0.9550630116009288]],
      shape=(334, 5), dtype=object)

In [85]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,sid,0.658487,0.091923,0.104064,0.760758,0.091913,0.36943,0.835384,0.784143,0.164027,...,0.363041,0.530805,0.658978,0.030316,0.840861,0.509772,0.011734,0.380769,0.91267,0.976828
1,0.814467,0.348628,0.556934,0.239439,0.395422,0.995828,0.855912,0.675226,0.369041,0.31771,...,0.866433,0.952527,0.89498,0.766907,0.963838,0.626588,0.893575,0.998329,0.707689,0.007592
2,0.157192,0.58117,0.990653,0.642198,0.985345,0.623569,0.038509,0.687771,0.987941,0.432461,...,0.008986,0.409979,0.903465,0.464956,0.493229,0.036562,0.129046,0.930352,0.922948,0.414077
3,0.68514,0.252771,0.664003,0.712952,0.955724,0.956102,0.823561,0.483374,0.847465,0.725584,...,0.993944,0.995664,0.36803,0.080287,0.128025,0.915045,0.391266,0.939311,0.2347,0.81321
4,0.58295,0.68012,0.406472,0.090039,0.838605,0.582061,0.787064,0.981125,0.219979,0.463473,...,0.463195,0.058227,0.707977,0.181451,0.042472,0.567029,0.890316,0.992738,0.164508,0.955063

In [86]:
newdf.head()

          0         1         2         3         4
0       sid  0.814467  0.157192  0.685140  0.582950
1  0.658487  0.348628  0.581170  0.252771  0.680120
2  0.091923  0.556934  0.990653  0.664003  0.406472
3  0.104064  0.239439  0.642198  0.712952  0.090039
4  0.760758  0.395422  0.985345  0.955724  0.838605

In [87]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,sid,0.658487,0.091923,0.104064,0.760758,0.091913,0.36943,0.835384,0.784143,0.164027,...,0.363041,0.530805,0.658978,0.030316,0.840861,0.509772,0.011734,0.380769,0.91267,0.976828
1,0.814467,0.348628,0.556934,0.239439,0.395422,0.995828,0.855912,0.675226,0.369041,0.31771,...,0.866433,0.952527,0.89498,0.766907,0.963838,0.626588,0.893575,0.998329,0.707689,0.007592
2,0.157192,0.58117,0.990653,0.642198,0.985345,0.623569,0.038509,0.687771,0.987941,0.432461,...,0.008986,0.409979,0.903465,0.464956,0.493229,0.036562,0.129046,0.930352,0.922948,0.414077
3,0.68514,0.252771,0.664003,0.712952,0.955724,0.956102,0.823561,0.483374,0.847465,0.725584,...,0.993944,0.995664,0.36803,0.080287,0.128025,0.915045,0.391266,0.939311,0.2347,0.81321
4,0.58295,0.68012,0.406472,0.090039,0.838605,0.582061,0.787064,0.981125,0.219979,0.463473,...,0.463195,0.058227,0.707977,0.181451,0.042472,0.567029,0.890316,0.992738,0.164508,0.955063

In [88]:
newdf.sort_index(axis=0,ascending=False) #sorting column-wise in descending order

            0         1         2         3         4
333  0.976828  0.007592  0.414077  0.813210  0.955063
332   0.91267  0.707689  0.922948  0.234700  0.164508
331  0.380769  0.998329  0.930352  0.939311  0.992738
330  0.011734  0.893575  0.129046  0.391266  0.890316
329  0.509772  0.626588  0.036562  0.915045  0.567029
..        ...       ...       ...       ...       ...
4    0.760758  0.395422  0.985345  0.955724  0.838605
3    0.104064  0.239439  0.642198  0.712952  0.090039
2    0.091923  0.556934  0.990653  0.664003  0.406472
1    0.658487  0.348628  0.581170  0.252771  0.680120
0         sid  0.814467  0.157192  0.685140  0.582950

[334 rows x 5 columns]

In [89]:
newdf[0][0]=0.55

In [90]:
newdf

            0         1         2         3         4
0        0.55  0.814467  0.157192  0.685140  0.582950
1    0.658487  0.348628  0.581170  0.252771  0.680120
2    0.091923  0.556934  0.990653  0.664003  0.406472
3    0.104064  0.239439  0.642198  0.712952  0.090039
4    0.760758  0.395422  0.985345  0.955724  0.838605
..        ...       ...       ...       ...       ...
329  0.509772  0.626588  0.036562  0.915045  0.567029
330  0.011734  0.893575  0.129046  0.391266  0.890316
331  0.380769  0.998329  0.930352  0.939311  0.992738
332   0.91267  0.707689  0.922948  0.234700  0.164508
333  0.976828  0.007592  0.414077  0.813210  0.955063

[334 rows x 5 columns]

In [91]:
newdf.sort_index(axis=1,ascending=False) #sorting rows-wise in descending order

            4         3         2         1         0
0    0.582950  0.685140  0.157192  0.814467      0.55
1    0.680120  0.252771  0.581170  0.348628  0.658487
2    0.406472  0.664003  0.990653  0.556934  0.091923
3    0.090039  0.712952  0.642198  0.239439  0.104064
4    0.838605  0.955724  0.985345  0.395422  0.760758
..        ...       ...       ...       ...       ...
329  0.567029  0.915045  0.036562  0.626588  0.509772
330  0.890316  0.391266  0.129046  0.893575  0.011734
331  0.992738  0.939311  0.930352  0.998329  0.380769
332  0.164508  0.234700  0.922948  0.707689   0.91267
333  0.955063  0.813210  0.414077  0.007592  0.976828

[334 rows x 5 columns]

In [ ]:
'''
loc stands for location-based indexing.
It is used to access or modify data in a DataFrame by label (not by position like iloc).
*****Syntax:*******
DataFrame.loc[row_label, column_label]

'''
newdf.loc[0,0]=654

In [93]:
newdf.head(4)

          0         1         2         3         4
0       654  0.814467  0.157192  0.685140  0.582950
1  0.658487  0.348628  0.581170  0.252771  0.680120
2  0.091923  0.556934  0.990653  0.664003  0.406472
3  0.104064  0.239439  0.642198  0.712952  0.090039

In [96]:
newdf.head()

          0         1         2         3         4
0       654  0.814467  0.157192  0.685140  0.582950
1  0.658487  0.348628  0.581170  0.252771  0.680120
2  0.091923  0.556934  0.990653  0.664003  0.406472
3  0.104064  0.239439  0.642198  0.712952  0.090039
4  0.760758  0.395422  0.985345  0.955724  0.838605

In [99]:
newdf.loc[0,0]=98765

In [100]:
newdf.columns=list("ABCDE")

In [101]:
newdf.head()

          A         B         C         D         E
0     98765  0.814467  0.157192  0.685140  0.582950
1  0.658487  0.348628  0.581170  0.252771  0.680120
2  0.091923  0.556934  0.990653  0.664003  0.406472
3  0.104064  0.239439  0.642198  0.712952  0.090039
4  0.760758  0.395422  0.985345  0.955724  0.838605

In [102]:
newdf.loc[0,0]=97429

In [103]:
newdf.head()

          A         B         C         D         E        0
0     98765  0.814467  0.157192  0.685140  0.582950  97429.0
1  0.658487  0.348628  0.581170  0.252771  0.680120      NaN
2  0.091923  0.556934  0.990653  0.664003  0.406472      NaN
3  0.104064  0.239439  0.642198  0.712952  0.090039      NaN
4  0.760758  0.395422  0.985345  0.955724  0.838605      NaN

In [104]:
newdf.loc[0,'A']=8766345

In [105]:
newdf.head()

          A         B         C         D         E        0
0   8766345  0.814467  0.157192  0.685140  0.582950  97429.0
1  0.658487  0.348628  0.581170  0.252771  0.680120      NaN
2  0.091923  0.556934  0.990653  0.664003  0.406472      NaN
3  0.104064  0.239439  0.642198  0.712952  0.090039      NaN
4  0.760758  0.395422  0.985345  0.955724  0.838605      NaN

In [107]:
#removing 0-columns using drop() method
newdf=newdf.drop(0,axis=1)
newdf.head()

          A         B         C         D         E
0   8766345  0.814467  0.157192  0.685140  0.582950
1  0.658487  0.348628  0.581170  0.252771  0.680120
2  0.091923  0.556934  0.990653  0.664003  0.406472
3  0.104064  0.239439  0.642198  0.712952  0.090039
4  0.760758  0.395422  0.985345  0.955724  0.838605

In [109]:
#it only return new dataframe not adding to the existing dataframe
newdf.loc[[1,2],['C','D']]

          C         D
1  0.581170  0.252771
2  0.990653  0.664003

In [ ]:
newdf.loc[:,["C",'D']] # this gives all rows of dataframe and ["C","D "] columns

            C         D
0    0.157192  0.685140
1    0.581170  0.252771
2    0.990653  0.664003
3    0.642198  0.712952
4    0.985345  0.955724
..        ...       ...
329  0.036562  0.915045
330  0.129046  0.391266
331  0.930352  0.939311
332  0.922948  0.234700
333  0.414077  0.813210

[334 rows x 2 columns]

In [ ]:
newdf.loc[[1,2],:] # this will gives all column of dataframes and [1,2] rows

          A         B         C         D         E
1  0.658487  0.348628  0.581170  0.252771  0.680120
2  0.091923  0.556934  0.990653  0.664003  0.406472

In [115]:
newdf.loc[(newdf["A"]<0.4)] # this return all values of 'A' col whose value is <0.4

            A         B         C         D         E
2    0.091923  0.556934  0.990653  0.664003  0.406472
3    0.104064  0.239439  0.642198  0.712952  0.090039
5    0.091913  0.995828  0.623569  0.956102  0.582061
6     0.36943  0.855912  0.038509  0.823561  0.787064
9    0.164027  0.317710  0.432461  0.725584  0.463473
..        ...       ...       ...       ...       ...
323  0.346997  0.532920  0.469934  0.547989  0.569770
324  0.363041  0.866433  0.008986  0.993944  0.463195
327  0.030316  0.766907  0.464956  0.080287  0.181451
330  0.011734  0.893575  0.129046  0.391266  0.890316
331  0.380769  0.998329  0.930352  0.939311  0.992738

[134 rows x 5 columns]

In [116]:
newdf.loc[(newdf["C"]>0.6)]

            A         B         C         D         E
2    0.091923  0.556934  0.990653  0.664003  0.406472
3    0.104064  0.239439  0.642198  0.712952  0.090039
4    0.760758  0.395422  0.985345  0.955724  0.838605
5    0.091913  0.995828  0.623569  0.956102  0.582061
7    0.835384  0.675226  0.687771  0.483374  0.981125
..        ...       ...       ...       ...       ...
317  0.474835  0.073287  0.942349  0.846646  0.142501
321  0.851627  0.370854  0.631559  0.599336  0.859124
326  0.658978  0.894980  0.903465  0.368030  0.707977
331  0.380769  0.998329  0.930352  0.939311  0.992738
332   0.91267  0.707689  0.922948  0.234700  0.164508

[134 rows x 5 columns]

In [117]:
newdf.loc[(newdf["A"]<0.3) & (newdf["C"]>0.1)]

            A         B         C         D         E
2    0.091923  0.556934  0.990653  0.664003  0.406472
3    0.104064  0.239439  0.642198  0.712952  0.090039
5    0.091913  0.995828  0.623569  0.956102  0.582061
9    0.164027  0.317710  0.432461  0.725584  0.463473
11   0.142561  0.610870  0.109826  0.826146  0.008565
..        ...       ...       ...       ...       ...
314   0.00172  0.188020  0.508459  0.008612  0.022947
315  0.031097  0.931032  0.300919  0.856752  0.206673
319  0.157426  0.288110  0.520196  0.542638  0.243904
327  0.030316  0.766907  0.464956  0.080287  0.181451
330  0.011734  0.893575  0.129046  0.391266  0.890316

[90 rows x 5 columns]

In [ ]:
#to get specific value using index with method iloc[]
''' 
.iloc stands for integer-location-based indexing.
It lets you access or modify rows and columns in a DataFrame
 by their integer position (just like list or array indexing in Python).
 ******  Syntax:********
 df.iloc[row_index, column_index]

'''
newdf.iloc[0,4]

np.float64(0.5829496326045431)

In [119]:
newdf.head()

          A         B         C         D         E
0   8766345  0.814467  0.157192  0.685140  0.582950
1  0.658487  0.348628  0.581170  0.252771  0.680120
2  0.091923  0.556934  0.990653  0.664003  0.406472
3  0.104064  0.239439  0.642198  0.712952  0.090039
4  0.760758  0.395422  0.985345  0.955724  0.838605

In [120]:
newdf.iloc[0,4]

np.float64(0.5829496326045431)

In [ ]:
newdf.iloc[[0,4],[1,3]]  # [0,4] denote the cell value and [1,3] denote index in column

          B         D
0  0.814467  0.685140
4  0.395422  0.955724

In [122]:
newdf.head(4)

          A         B         C         D         E
0   8766345  0.814467  0.157192  0.685140  0.582950
1  0.658487  0.348628  0.581170  0.252771  0.680120
2  0.091923  0.556934  0.990653  0.664003  0.406472
3  0.104064  0.239439  0.642198  0.712952  0.090039

In [123]:
newdf.iloc[[2,3],[1,4]]

          B         E
2  0.556934  0.406472
3  0.239439  0.090039

In [ ]:
# remove specific rows using drop() method but it doesn't affect original dataframe
newdf.drop([0])

            A         B         C         D         E
1    0.658487  0.348628  0.581170  0.252771  0.680120
2    0.091923  0.556934  0.990653  0.664003  0.406472
3    0.104064  0.239439  0.642198  0.712952  0.090039
4    0.760758  0.395422  0.985345  0.955724  0.838605
5    0.091913  0.995828  0.623569  0.956102  0.582061
..        ...       ...       ...       ...       ...
329  0.509772  0.626588  0.036562  0.915045  0.567029
330  0.011734  0.893575  0.129046  0.391266  0.890316
331  0.380769  0.998329  0.930352  0.939311  0.992738
332   0.91267  0.707689  0.922948  0.234700  0.164508
333  0.976828  0.007592  0.414077  0.813210  0.955063

[333 rows x 5 columns]

In [ ]:
newdf.drop(["A","D"],axis=1)  # it will remove specific column

            B         C         E
0    0.814467  0.157192  0.582950
1    0.348628  0.581170  0.680120
2    0.556934  0.990653  0.406472
3    0.239439  0.642198  0.090039
4    0.395422  0.985345  0.838605
..        ...       ...       ...
329  0.626588  0.036562  0.567029
330  0.893575  0.129046  0.890316
331  0.998329  0.930352  0.992738
332  0.707689  0.922948  0.164508
333  0.007592  0.414077  0.955063

[334 rows x 3 columns]

###  we can change dataframe in original  using inplace=True attributes

In [126]:
newdf.drop(["A","E"],axis=1,inplace=True)

In [ ]:
newdf  # here we got only B,C,D column in original dataframe

            B         C         D
0    0.814467  0.157192  0.685140
1    0.348628  0.581170  0.252771
2    0.556934  0.990653  0.664003
3    0.239439  0.642198  0.712952
4    0.395422  0.985345  0.955724
..        ...       ...       ...
329  0.626588  0.036562  0.915045
330  0.893575  0.129046  0.391266
331  0.998329  0.930352  0.939311
332  0.707689  0.922948  0.234700
333  0.007592  0.414077  0.813210

[334 rows x 3 columns]

In [129]:
newdf.drop([1,5],axis=0,inplace=True)

In [130]:
newdf

            B         C         D
0    0.814467  0.157192  0.685140
2    0.556934  0.990653  0.664003
3    0.239439  0.642198  0.712952
4    0.395422  0.985345  0.955724
6    0.855912  0.038509  0.823561
..        ...       ...       ...
329  0.626588  0.036562  0.915045
330  0.893575  0.129046  0.391266
331  0.998329  0.930352  0.939311
332  0.707689  0.922948  0.234700
333  0.007592  0.414077  0.813210

[332 rows x 3 columns]

In [131]:
newdf.head(3)

          B         C         D
0  0.814467  0.157192  0.685140
2  0.556934  0.990653  0.664003
3  0.239439  0.642198  0.712952

In [135]:
newdf.reset_index()  # it will give another index starting from 0
# but if we don't want that disorder index only want ascending index then 
newdf.reset_index(drop=True,inplace=True)
newdf

            B         C         D
0    0.814467  0.157192  0.685140
1    0.556934  0.990653  0.664003
2    0.239439  0.642198  0.712952
3    0.395422  0.985345  0.955724
4    0.855912  0.038509  0.823561
..        ...       ...       ...
327  0.626588  0.036562  0.915045
328  0.893575  0.129046  0.391266
329  0.998329  0.930352  0.939311
330  0.707689  0.922948  0.234700
331  0.007592  0.414077  0.813210

[332 rows x 3 columns]

In [136]:
newdf.head(4)

          B         C         D
0  0.814467  0.157192  0.685140
1  0.556934  0.990653  0.664003
2  0.239439  0.642198  0.712952
3  0.395422  0.985345  0.955724

In [139]:
newdf["B"]=None # this makes all B-col None
newdf.head()

      B         C         D
0  None  0.157192  0.685140
1  None  0.990653  0.664003
2  None  0.642198  0.712952
3  None  0.985345  0.955724
4  None  0.038509  0.823561

In [140]:
newdf["B"].isnull()  # it gives boolean value to chek whether it is null or not
newdf.head()

      B         C         D
0  None  0.157192  0.685140
1  None  0.990653  0.664003
2  None  0.642198  0.712952
3  None  0.985345  0.955724
4  None  0.038509  0.823561

In [143]:
# best way to assign any value in column
newdf.loc[:,["B"]]=56
newdf.head()

    B         C         D
0  56  0.157192  0.685140
1  56  0.990653  0.664003
2  56  0.642198  0.712952
3  56  0.985345  0.955724
4  56  0.038509  0.823561

In [147]:
dat=pd.DataFrame({
    "name":['Alfred','Batman','Superman'],
    "toy":[np.nan,'Batmobile','Bulwhip'],
    "born":[pd.NaT,pd.Timestamp("1940-04-25"),pd.NaT]
})
dat.head()

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Superman    Bulwhip        NaT

In [148]:
# if we want to remove NaN
dat.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [ ]:
dat.dropna(how="all")   # if all are NaN then only dropna() method works

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Superman    Bulwhip        NaT

In [ ]:
df=pd.DataFrame({
    "name":['Alfred',np.nan,'Superman'],
    "toy":[np.nan,np.nan,'Bulwhip'],
    "born":[pd.NaT,np.nan,pd.NaT]
})

In [154]:
df.head()

       name      toy born
0    Alfred      NaN  NaT
1       NaN      NaN  NaT
2  Superman  Bulwhip  NaT

In [157]:
df.dropna(how="all",axis=1,inplace=True)
df

       name      toy
0    Alfred      NaN
1       NaN      NaN
2  Superman  Bulwhip

In [155]:
df.head()

       name      toy born
0    Alfred      NaN  NaT
1       NaN      NaN  NaT
2  Superman  Bulwhip  NaT

In [161]:
dt=pd.DataFrame({
    "name":['Alfred','Alex','Alfred'],
    "toy":[np.nan,np.nan,'Bulwhip'],
    "born":[pd.NaT,pd.Timestamp("2003-05-15"),pd.NaT]
})
dt.drop_duplicates(subset=['name'],keep="last")

     name      toy       born
1    Alex      NaN 2003-05-15
2  Alfred  Bulwhip        NaT

In [163]:
df.shape

(3, 2)

In [164]:
dt.shape

(3, 3)

In [165]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     1 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 204.0+ bytes

In [166]:
dt["toy"].value_counts(dropna=True)

toy
Bulwhip    1
Name: count, dtype: int64

In [167]:
dt['name'].value_counts(dropna=False)

name
Alfred    2
Alex      1
Name: count, dtype: int64

In [168]:
dt.notnull()

   name    toy   born
0  True  False  False
1  True  False   True
2  True   True  False

In [ ]:
# create a dataframe which contains only integers with 3 rows and 2 columns
# run with following dataframe methods on them
'''
df.describe()
df.mean()
df.corr()
df.count()
df.max()
df.min()
df.median()
df.std()
'''
# Create a 3x2 DataFrame of integers
df = pd.DataFrame(np.array([[1, 2],
                            [3, 4],
                            [5, 6],
                            [9,2]]),
                  columns=['A', 'B'])

print(df)
df.describe()
df.corr()
df.median()
# df.mean()
df.std()
# df.count()
# df.mean()

   A  B
0  1  2
1  3  4
2  5  6
3  9  2

A    3.415650
B    1.914854
dtype: float64

In [ ]:


df = pd.Series([1, 3, 5, 9])

print(df.std())         # sample std â†’ 3.41
print(df.std(ddof=0
             
             ))   # population std â†’ 2.96

3.415650255319866
2.958039891549808